# U.S. Major League Soccer Salaries Data Analysis

#### Importing Pandas and Numpy

In [17]:
import pandas as pd
import numpy as np

#### Reading file and printing first 10 rows for summary

In [18]:
salaries = pd.read_csv("mls-salaries-2017.csv")
salaries.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,M,75000.0,93750.00

#### Length of rows and columns of data

In [19]:
print("Length of Rows: {}".format(salaries.shape[0]))
print("Length of Columns: {}".format(salaries.shape[1]))

Length of Rows: 616
Length of Columns: 6

#### Average salaries of soccer players

In [20]:
print("Average of salary of soccer players: {}".format(round(salaries.base_salary.mean(),2)))

Average of salary of soccer players: 296977.74

#### Highest Salary

In [21]:
salaries[salaries["base_salary"].max() == salaries["base_salary"]]

    club last_name first_name position  base_salary  guaranteed_compensation
401  ORL      Kaka        NaN        M    6660000.0                7167500.0

#### Lowest Salary

In [22]:
salaries[salaries["base_salary"].min() == salaries["base_salary"]]

      club last_name first_name position  base_salary  guaranteed_compensation
348  NYCFC     Okoli       Sean        F     52999.92                 52999.92
523    SEA      Tolo     Nouhou        D     52999.92                 52999.92

#### Positions of MLS

In [23]:
for i in salaries["position"].unique():
    print("Position: ",i)

Position:  M
Position:  D
Position:  F
Position:  GK
Position:  M-F
Position:  F-M
Position:  D-M
Position:  M-D
Position:  M/F
Position:  F/M

#### Data set showing how many players played in each position

In [24]:
print(salaries["position"].value_counts())

M      212
D      185
F      109
GK      65
M-F     19
D-M     14
F-M      6
M-D      4
F/M      1
M/F      1
Name: position, dtype: int64

#### Average Salary by positions

In [25]:
salaries.groupby("position").mean()

            base_salary  guaranteed_compensation
position
D         166574.093784            179533.184811
D-M       134930.000000            154328.927857
F         489588.598349            557437.206514
F-M       335834.000000            367920.805000
F/M       125000.000000            131250.000000
GK        146472.515538            158665.155692
M         376106.218632            406781.788396
M-D       219032.250000            230282.250000
M-F       212975.604211            231104.551579
M/F       550000.000000            565000.000000

#### Data set showing how many players played in team

In [26]:
print(salaries["club"].value_counts())

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
NYRB     28
HOU      28
MNUFC    27
LA       27
CHI      27
POR      27
DC       27
RSL      27
MTL      27
TOR      27
COL      26
KC       26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

#### Min, Mean and Max Salary and compensation for each team

In [27]:
salaries.groupby("club").aggregate(["min",np.mean,"max"])

      base_salary                            guaranteed_compensation  \
              min           mean         max                     min
club
ATL      53000.00  259213.420645  1912500.00                53000.00
CHI      53004.00  454541.629630  5400000.00                53004.00
CLB      53004.00  211507.749333  1050000.00                53004.00
COL      53004.00  279028.798077  2000000.00                54075.00
DAL      53000.00  206571.699310   784000.00                53000.00
DC       53004.00  178227.238519   500000.00                56754.00
HOU      53000.00  175144.642143   650000.00                53004.00
KC       53000.00  239378.769231   850000.00                53000.00
LA       53004.00  364209.875556  3750000.00                53004.00
LAFC     53004.00   59004.000000    65004.00                53004.00
MNUFC    53004.00  182446.149630   550008.00                53004.00
MTL      53000.00  187950.780741   700000.08                53004.00
NE       53004.00  235086.663043   840000.00                53004.00
NYCFC    52999.92  620375.917143  5610000.00                52999.92
NYRB     53000.00  225499.357143  1500000.00                53004.00
ORL      53000.00  412735.126667  6660000.00                53000.00
PHI      53004.00  210221.806452  1131000.00                53004.00
POR      53000.00  344241.927407  2227500.00                53000.00
RSL      53004.00  253942.238519  1750000.00                53004.00
SEA      52999.92  359468.115600  3200000.00                52999.92
SJ       53004.00  221709.172414   800000.00                53004.00
TOR      53004.00  743516.555556  6000000.00                53004.00
VAN      54075.00  220011.440000  1400000.04                54075.00


                mean         max
club
ATL    290572.847097  2297000.00
CHI    479714.006296  5400000.00
CLB    224918.166333  1050000.00
COL    309254.605769  2475000.00
DAL    235371.066897   880890.00
DC     195275.849630   602000.00
HOU    181829.166071   665000.00
KC     253398.106923   850000.00
LA     451218.374444  5500000.00
LAFC    59004.000000    65004.00
MNUFC  197143.131481   555008.00
MTL    196096.514444   719541.75
NE     252179.057826   890541.75
NYCFC  640370.203214  5915690.00
NYRB   246256.648929  1635000.00
ORL    440639.990000  7167500.00
PHI    229580.970968  1197250.00
POR    400894.242222  2607500.00
RSL    274790.942222  1973750.00
SEA    412246.019200  3892933.50
SJ     239975.417586   800000.00
TOR    829622.787778  7115555.67
VAN    252480.345938  1800000.04